Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыОснПродавцом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияАнализовПоМедКнижке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промоутер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорпоративнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорпоративныеБанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнештатныйСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьВнештатника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитСкладу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяИнициаторомЗаявокНаРасходДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБонусаПомощникаУправляющего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗуп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Информация для помошника управляющего (Откуда сотрудник будет ехать на подработку)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомощникТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КабинетРассылкиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РоумингТолькоСвоиЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПсихологОсв</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникТилси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуперпользовательТехбота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноЗанятый</Name>
					<Comment>Признак назначается физ. лицам, с неполной занятостью (студентам пр.) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВахтыВГрафике</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВахтГрафикиРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПройденныеТренинги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тренинг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрохождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТренингПройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦФОСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦФОСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПользователиПоЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПользователиПоЦФО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыТорговыхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкороОткрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкороЗакрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФизическиеЛица/Forms/ФормаВыбораПомощников/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДеревоПодчиненностиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДеревоПодчиненности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДерева

&НаКлиенте
Процедура СписокПомощниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Новый Структура("ПомощникТУ", Элемент.ТекущиеДанные.Ссылка));

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодчиненностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Закрыть(Новый Структура("ПомощникТУ", Элемент.ТекущиеДанные.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПодчиненности.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
		И ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Закрыть(Новый Структура("ПомощникТУ", ТекущиеДанные.Ссылка));

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗначение(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПодчиненности.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДеревоПодчиненностиСервер()
	
	ТекущееДерево = РеквизитФормыВЗначение("ДеревоПодчиненности");
	ТекущееДерево.Строки.Очистить();
	
	Запрос = Новый Запрос();
	
	//+++АК mika 2018.04.17 ИП-00018288
	//Запрос.Текст = ПолучитьТекстЗапросаДляПостроенияДерева();
	Запрос.Текст = ПолучитьТекстЗапросаДляПостроенияДереваПоРолям();
	//---АК mika ИП-00018288
	
	Запрос.УстановитьПараметр("ЦФО", Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЦФО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦФО.Следующий() Цикл
			
			СтрокаЦФО = ТекущееДерево.Строки.Добавить();
			СтрокаЦФО.Ссылка = ВыборкаЦФО.ЦФО;
			
			ВыборкаПомощник = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПомощник.Следующий() Цикл
				
				СтрокаПомощник = СтрокаЦФО.Строки.Добавить();
				СтрокаПомощник.Ссылка = ВыборкаПомощник.ПомощникТУ;
				
				ВыборкаТорговаяТочка = ВыборкаПомощник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТорговаяТочка.Следующий() Цикл
					СтрокаТорговаяТочка = СтрокаПомощник.Строки.Добавить();
					СтрокаТорговаяТочка.Ссылка = ВыборкаТорговаяТочка.СтруктурнаяЕдиница;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекущееДерево, "ДеревоПодчиненности");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаДляПостроенияДерева()

	Возврат
	
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО,
	 |	ЦФОСтруктурныхЕдиницСрезПоследних.СтруктурнаяЕдиница
	 |ПОМЕСТИТЬ ВТ_ЦФО
	 |ИЗ
	 |	РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(
	 |			&ТекущаяДата,
	 |			ВЫБОР
	 |				КОГДА &ЦФО <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	 |					ТОГДА ЦФО = &ЦФО
	 |				ИНАЧЕ ИСТИНА
	 |			КОНЕЦ) КАК ЦФОСтруктурныхЕдиницСрезПоследних
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СоответствиеОбъектРольСрезПоследних.ТипРоли,
	 |	СоответствиеОбъектРольСрезПоследних.Объект,
	 |	СоответствиеОбъектРольСрезПоследних.РольПользователя,
	 |	СоответствиеОбъектРольСрезПоследних.ТипРолиID,
	 |	РолиПользователейСоставРоли.Сотрудник
	 |ПОМЕСТИТЬ ВТ_Помощники_ТУ_Соотв
	 |ИЗ
	 //+++ AK suvv 2018.06.08 ИП-00018376.01
	 //|	РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&ТекущаяДата, ТипРолиID = ""PomoshnikTerrUpravlyushego"") КАК СоответствиеОбъектРольСрезПоследних
	 |	РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&ТекущаяДата, ТипРолиID = ""PomoshnikTerrUpravlyushego"" или ТипРолиID = ""PomoshnikStorRozn"") КАК СоответствиеОбъектРольСрезПоследних
	 //--- AK suvv
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
	 |		ПО СоответствиеОбъектРольСрезПоследних.РольПользователя = РолиПользователейСоставРоли.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ЦФО.ЦФО КАК ЦФО,
	 |	ВТ_Помощники_ТУ_Соотв.Сотрудник КАК ПомощникТУ,
	 |	ВТ_ЦФО.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	 |ИЗ
	 |	ВТ_ЦФО КАК ВТ_ЦФО
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Помощники_ТУ_Соотв КАК ВТ_Помощники_ТУ_Соотв
	 |		ПО ВТ_ЦФО.СтруктурнаяЕдиница = ВТ_Помощники_ТУ_Соотв.Объект
	 |ГДЕ
	 |	ВТ_Помощники_ТУ_Соотв.Сотрудник <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ЦФО,
	 |	ПомощникТУ,
	 |	СтруктурнаяЕдиница
	 |ИТОГИ ПО
	 |	ЦФО,
	 |	ПомощникТУ,
	 |	СтруктурнаяЕдиница
	 |АВТОУПОРЯДОЧИВАНИЕ";

КонецФункции


&НаСервере
Функция ПолучитьТекстЗапросаДляПостроенияДереваПоРолям()

	//Определения "Группы управления" для помощника изменено с "фактического"(привязка по ЦФО структурных единиц) на привязку Управляющего(Руководитель отдела)
	//В регистре "Пользователи по ЦФО". Привязка определяется как: 
	//Помощник → Доступные магазины → Функциональналя роль помощника(Родитель или Родитель.Родитель для группы Управление Развитием) → Пользователь(Управляющий, согласно родителя функ. роли) → Пользователи ЦФО(Срез последник, с признаком Руководитель отдела).
	Возврат
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиПоЦФОСрезПоследних.ЦФО,
	|	МАКСИМУМ(ПользователиПоЦФОСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПользователиПоЦФОДаты
	|ИЗ
	|	РегистрСведений.ПользователиПоЦФО.СрезПоследних(&ТекущаяДата, ) КАК ПользователиПоЦФОСрезПоследних
	|ГДЕ
	|	ПользователиПоЦФОСрезПоследних.РуководительОтдела
	|
	|СГРУППИРОВАТЬ ПО
	|	ПользователиПоЦФОСрезПоследних.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПользователиПоЦФО.Сотрудник,
	|	МАКСИМУМ(ПользователиПоЦФО.ЦФО) КАК ЦФО
	|ПОМЕСТИТЬ ВТ_РуководителиПоЦФО
	|ИЗ
	|	ВТ_ПользователиПоЦФОДаты КАК ВТ_ПользователиПоЦФОДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиПоЦФО КАК ПользователиПоЦФО
	|		ПО ВТ_ПользователиПоЦФОДаты.ЦФО = ПользователиПоЦФО.ЦФО
	|			И ВТ_ПользователиПоЦФОДаты.Период = ПользователиПоЦФО.Период
	|			И (ПользователиПоЦФО.РуководительОтдела)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПользователиПоЦФО.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РуководителиПоЦФО.ЦФО КАК ЦФО,
	|	ТабИтоговая.Помощник КАК ПомощникТУ,
	|	ТабИтоговая.ТорговаяТочка КАК СтруктурнаяЕдиница,
	|	Пользователи.Ссылка КАК УправляющийПользователь
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоответствиеОбъектРольСрезПоследних.ТипРоли КАК ТипРоли,
	|		СоответствиеОбъектРольСрезПоследних.Объект КАК ТорговаяТочка,
	|		СоответствиеОбъектРольСрезПоследних.РольПользователя КАК РольПомощника,
	|		СоответствиеОбъектРольСрезПоследних.РольПользователя.Родитель КАК РольПользователяРодитель,
	|		СоответствиеОбъектРольСрезПоследних.РольПользователя.Родитель.Родитель КАК РольПользователяРодительРодитель,
	|		СоответствиеОбъектРольСрезПоследних.ТипРолиID КАК ТипРолиID,
	|		РолиПользователейСоставРоли.Сотрудник КАК Помощник,
	|		ВЫБОР
	|			КОГДА НЕ РолиПользователейСоставРолиРодительРодитель.Сотрудник ЕСТЬ NULL
	|				ТОГДА РолиПользователейСоставРолиРодительРодитель.Сотрудник
	|			ИНАЧЕ РолиПользователейСоставРолиРодитель.Сотрудник
	|		КОНЕЦ КАК УправляющийФизЛицо
	|	ИЗ
	|		Справочник.РолиПользователей.ТипыРолей КАК РолиПользователейТипыРолей
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
	|						&ТекущаяДата,
	//+++ AK suvv 2018.06.08 ИП-00018376.01
	//|						ТипРолиID = ""PomoshnikTerrUpravlyushego""
	|						(ТипРолиID = ""PomoshnikTerrUpravlyushego"" или ТипРолиID = ""PomoshnikStorRozn"") 
	//--- AK suvv
	|							И Объект.СтатусТорговойТочки <> ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)
	|							И Объект ССЫЛКА Справочник.СтруктурныеЕдиницы) КАК СоответствиеОбъектРольСрезПоследних
	|				ПО (СоответствиеОбъектРольСрезПоследних.РольПользователя = РолиПользователейСоставРоли.Ссылка)
	|			ПО РолиПользователейТипыРолей.Ссылка = РолиПользователейСоставРоли.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРолиРодитель
	|			ПО РолиПользователейТипыРолей.Ссылка.Родитель = РолиПользователейСоставРолиРодитель.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРолиРодительРодитель
	|			ПО РолиПользователейТипыРолей.Ссылка.Родитель.Родитель = РолиПользователейСоставРолиРодительРодитель.Ссылка
	|	ГДЕ
	|		РолиПользователейСоставРоли.Сотрудник.Активный
	//+++ AK suvv 2018.06.08 ИП-00018376.01
	//|		И РолиПользователейТипыРолей.ТипРоли.Код = ""PomoshnikTerrUpravlyushego"") КАК ТабИтоговая
	|		И (РолиПользователейТипыРолей.ТипРоли.Код = ""PomoshnikTerrUpravlyushego"" или РолиПользователейТипыРолей.ТипРоли.Код = ""PomoshnikStorRozn"")) КАК ТабИтоговая
	//--- AK suvv 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РуководителиПоЦФО КАК ВТ_РуководителиПоЦФО
	|			ПО Пользователи.Ссылка = ВТ_РуководителиПоЦФО.Сотрудник
	|		ПО ТабИтоговая.УправляющийФизЛицо = Пользователи.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_РуководителиПоЦФО.ЦФО,
	|	ПомощникТУ,
	|	СтруктурнаяЕдиница
	|ИТОГИ ПО
	|	ЦФО,
	|	ПомощникТУ,
	|	СтруктурнаяЕдиница
	|АВТОУПОРЯДОЧИВАНИЕ";

КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоПодчиненности()
	
	КоллекцияПервогоУровня = ДеревоПодчиненности.ПолучитьЭлементы();
	
	Для Каждого ЭлементПервогоУровня Из КоллекцияПервогоУровня Цикл
		РазвернутьСтрокиДерева(ЭлементПервогоУровня.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиДерева(ИдентификаторСтроки)
	
	Элементы.ДеревоПодчиненности.Развернуть(ИдентификаторСтроки, Ложь);
	
КонецПроцедуры

#КонецОбласти
